"""
Задача 1.1. Три квадрата
[математика; задачи для начинающих]

Фермер владеет участком земли в форме прямоугольника с длинами сторон aa и bb. Недавно фермер понял, что может разбить свой участок на три части так, что каждая часть будет иметь форму квадрата, и решил воспользоваться этой возможностью. Напишите программу, которая найдет площадь каждой части после разбиения.
Формат входных данных

На вход подается два натуральных числа  aa и bb — длины сторон прямоугольника. Числа не превосходят 1000. Каждое число подается в отдельной строке. Гарантируется, что длины сторон таковы, что прямоугольник может быть разбит на три квадрата.
Формат выходных данных

Требуется вывести через пробел три натуральных числа — площади каждого из участков после разбиения. Числа могут выводиться в произвольном порядке.
Методика проверки

Программа проверяется на 15 тестах. Прохождение каждого теста оценивается в 1 балл.  Тест из условия задачи при проверке не используется.
Sample Input 1:

120
80
Sample Output 1:

6400 1600 1600
Пояснение к примеру

При заданных размерах прямоугольник может быть разбит на три квадрата так, как показано на рисунке ниже. Обратите внимание, что могут существовать и другие варианты разбиения.2
"""